Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0512gph048.h
extern volatile __IPC6bits_t IPC6bits __asm__ ("IPC6") __attribute__((section("sfrs"), address(0xBF8101A0)));
extern volatile uint32_t        IPC6CLR __attribute__((section("sfrs"),address(0xBF8101A4)));
extern volatile uint32_t        IPC6SET __attribute__((section("sfrs"),address(0xBF8101A8)));
extern volatile uint32_t        IPC6INV __attribute__((section("sfrs"),address(0xBF8101AC)));
#define IPC7 IPC7
extern volatile uint32_t   IPC7 __attribute__((section("sfrs"), address(0xBF8101B0)));
typedef union {
  struct {
    uint32_t :16;
    uint32_t RTCCIS:2;
    uint32_t RTCCIP:3;
    uint32_t :3;
    uint32_t FCEIS:2;
    uint32_t FCEIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC7bits_t;
extern volatile __IPC7bits_t IPC7bits __asm__ ("IPC7") __attribute__((section("sfrs"), address(0xBF8101B0)));
extern volatile uint32_t        IPC7CLR __attribute__((section("sfrs"),address(0xBF8101B4)));
extern volatile uint32_t        IPC7SET __attribute__((section("sfrs"),address(0xBF8101B8)));
extern volatile uint32_t        IPC7INV __attribute__((section("sfrs"),address(0xBF8101BC)));
#define IPC8 IPC8
extern volatile uint32_t   IPC8 __attribute__((section("sfrs"), address(0xBF8101C0)));
typedef union {
  struct {
    uint32_t CMP1IS:2;
    uint32_t CMP1IP:3;
    uint32_t :3;
    uint32_t CMP2IS:2;
    uint32_t CMP2IP:3;
    uint32_t :11;
    uint32_t SPI1EIS:2;
    uint32_t SPI1EIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC8bits_t;
extern volatile __IPC8bits_t IPC8bits __asm__ ("IPC8") __attribute__((section("sfrs"), address(0xBF8101C0)));
extern volatile uint32_t        IPC8CLR __attribute__((section("sfrs"),address(0xBF8101C4)));
extern volatile uint32_t        IPC8SET __attribute__((section("sfrs"),address(0xBF8101C8)));
extern volatile uint32_t        IPC8INV __attribute__((section("sfrs"),address(0xBF8101CC)));
#define IPC9 IPC9
extern volatile uint32_t   IPC9 __attribute__((section("sfrs"), address(0xBF8101D0)));
typedef union {
  struct {
    uint32_t SPI1RXIS:2;
    uint32_t SPI1RXIP:3;
    uint32_t :3;
    uint32_t SPI1TXIS:2;
    uint32_t SPI1TXIP:3;
    uint32_t :3;
    uint32_t U1EIS:2;
    uint32_t U1EIP:3;
    uint32_t :3;
    uint32_t U1RXIS:2;
    uint32_t U1RXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC9bits_t;
extern volatile __IPC9bits_t IPC9bits __asm__ ("IPC9") __attribute__((section("sfrs"), address(0xBF8101D0)));
extern volatile uint32_t        IPC9CLR __attribute__((section("sfrs"),address(0xBF8101D4)));
extern volatile uint32_t        IPC9SET __attribute__((section("sfrs"),address(0xBF8101D8)));
extern volatile uint32_t        IPC9INV __attribute__((section("sfrs"),address(0xBF8101DC)));
#define IPC10 IPC10
extern volatile uint32_t   IPC10 __attribute__((section("sfrs"), address(0xBF8101E0)));
typedef union {
  struct {
    uint32_t U1TXIS:2;
    uint32_t U1TXIP:3;
    uint32_t :3;
    uint32_t I2C1BIS:2;
    uint32_t I2C1BIP:3;
    uint32_t :3;
    uint32_t I2C1SIS:2;
    uint32_t I2C1SIP:3;
    uint32_t :3;
    uint32_t I2C1MIS:2;
    uint32_t I2C1MIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC10bits_t;
extern volatile __IPC10bits_t IPC10bits __asm__ ("IPC10") __attribute__((section("sfrs"), address(0xBF8101E0)));
extern volatile uint32_t        IPC10CLR __attribute__((section("sfrs"),address(0xBF8101E4)));
extern volatile uint32_t        IPC10SET __attribute__((section("sfrs"),address(0xBF8101E8)));
extern volatile uint32_t        IPC10INV __attribute__((section("sfrs"),address(0xBF8101EC)));
#define IPC11 IPC11
extern volatile uint32_t   IPC11 __attribute__((section("sfrs"), address(0xBF8101F0)));
typedef union {
  struct {
    uint32_t CNAIS:2;
    uint32_t CNAIP:3;
    uint32_t :3;
    uint32_t CNBIS:2;
    uint32_t CNBIP:3;
    uint32_t :3;
    uint32_t CNCIS:2;
    uint32_t CNCIP:3;
    uint32_t :3;
    uint32_t CNDIS:2;
    uint32_t CNDIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC11bits_t;
extern volatile __IPC11bits_t IPC11bits __asm__ ("IPC11") __attribute__((section("sfrs"), address(0xBF8101F0)));
extern volatile uint32_t        IPC11CLR __attribute__((section("sfrs"),address(0xBF8101F4)));
extern volatile uint32_t        IPC11SET __attribute__((section("sfrs"),address(0xBF8101F8)));
extern volatile uint32_t        IPC11INV __attribute__((section("sfrs"),address(0xBF8101FC)));
#define IPC12 IPC12
extern volatile uint32_t   IPC12 __attribute__((section("sfrs"), address(0xBF810200)));
typedef union {
  struct {
    uint32_t CNEIS:2;
    uint32_t CNEIP:3;
    uint32_t :3;
    uint32_t CNFIS:2;
    uint32_t CNFIP:3;
    uint32_t :3;
    uint32_t CNGIS:2;
    uint32_t CNGIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC12bits_t;
extern volatile __IPC12bits_t IPC12bits __asm__ ("IPC12") __attribute__((section("sfrs"), address(0xBF810200)));
extern volatile uint32_t        IPC12CLR __attribute__((section("sfrs"),address(0xBF810204)));
extern volatile uint32_t        IPC12SET __attribute__((section("sfrs"),address(0xBF810208)));
extern volatile uint32_t        IPC12INV __attribute__((section("sfrs"),address(0xBF81020C)));
#define IPC13 IPC13
extern volatile uint32_t   IPC13 __attribute__((section("sfrs"), address(0xBF810210)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SPI2EIS:2;
    uint32_t SPI2EIP:3;
    uint32_t :3;
    uint32_t SPI2RXIS:2;
    uint32_t SPI2RXIP:3;
    uint32_t :3;
    uint32_t SPI2TXIS:2;
    uint32_t SPI2TXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC13bits_t;
extern volatile __IPC13bits_t IPC13bits __asm__ ("IPC13") __attribute__((section("sfrs"), address(0xBF810210)));
extern volatile uint32_t        IPC13CLR __attribute__((section("sfrs"),address(0xBF810214)));
extern volatile uint32_t        IPC13SET __attribute__((section("sfrs"),address(0xBF810218)));
extern volatile uint32_t        IPC13INV __attribute__((section("sfrs"),address(0xBF81021C)));
#define IPC14 IPC14
extern volatile uint32_t   IPC14 __attribute__((section("sfrs"), address(0xBF810220)));
typedef union {
  struct {
    uint32_t U2EIS:2;
    uint32_t U2EIP:3;
    uint32_t :3;
    uint32_t U2RXIS:2;
    uint32_t U2RXIP:3;
    uint32_t :3;
    uint32_t U2TXIS:2;
    uint32_t U2TXIP:3;
    uint32_t :3;
    uint32_t I2C2BIS:2;
    uint32_t I2C2BIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC14bits_t;
