Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0512gph048.h
extern volatile __CFD1FIFOUA30bits_t CFD1FIFOUA30bits __asm__ ("CFD1FIFOUA30") __attribute__((section("sfrs"), address(0xBF880700)));
extern volatile uint32_t        CFD1FIFOUA30CLR __attribute__((section("sfrs"),address(0xBF880704)));
extern volatile uint32_t        CFD1FIFOUA30SET __attribute__((section("sfrs"),address(0xBF880708)));
extern volatile uint32_t        CFD1FIFOUA30INV __attribute__((section("sfrs"),address(0xBF88070C)));
#define CFD1FIFOCON31 CFD1FIFOCON31
extern volatile uint32_t   CFD1FIFOCON31 __attribute__((section("sfrs"), address(0xBF880710)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON31bits_t;
extern volatile __CFD1FIFOCON31bits_t CFD1FIFOCON31bits __asm__ ("CFD1FIFOCON31") __attribute__((section("sfrs"), address(0xBF880710)));
extern volatile uint32_t        CFD1FIFOCON31CLR __attribute__((section("sfrs"),address(0xBF880714)));
extern volatile uint32_t        CFD1FIFOCON31SET __attribute__((section("sfrs"),address(0xBF880718)));
extern volatile uint32_t        CFD1FIFOCON31INV __attribute__((section("sfrs"),address(0xBF88071C)));
#define CFD1FIFOSTA31 CFD1FIFOSTA31
extern volatile uint32_t   CFD1FIFOSTA31 __attribute__((section("sfrs"), address(0xBF880720)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA31bits_t;
extern volatile __CFD1FIFOSTA31bits_t CFD1FIFOSTA31bits __asm__ ("CFD1FIFOSTA31") __attribute__((section("sfrs"), address(0xBF880720)));
extern volatile uint32_t        CFD1FIFOSTA31CLR __attribute__((section("sfrs"),address(0xBF880724)));
extern volatile uint32_t        CFD1FIFOSTA31SET __attribute__((section("sfrs"),address(0xBF880728)));
extern volatile uint32_t        CFD1FIFOSTA31INV __attribute__((section("sfrs"),address(0xBF88072C)));
#define CFD1FIFOUA31 CFD1FIFOUA31
extern volatile uint32_t   CFD1FIFOUA31 __attribute__((section("sfrs"), address(0xBF880730)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA31bits_t;
extern volatile __CFD1FIFOUA31bits_t CFD1FIFOUA31bits __asm__ ("CFD1FIFOUA31") __attribute__((section("sfrs"), address(0xBF880730)));
extern volatile uint32_t        CFD1FIFOUA31CLR __attribute__((section("sfrs"),address(0xBF880734)));
extern volatile uint32_t        CFD1FIFOUA31SET __attribute__((section("sfrs"),address(0xBF880738)));
extern volatile uint32_t        CFD1FIFOUA31INV __attribute__((section("sfrs"),address(0xBF88073C)));
#define CFD1FLTCON0 CFD1FLTCON0
extern volatile uint32_t   CFD1FLTCON0 __attribute__((section("sfrs"), address(0xBF880740)));
typedef struct {
  uint32_t F0BP:5;
  uint32_t :2;
  uint32_t FLTEN0:1;
  uint32_t F1BP:5;
  uint32_t :2;
  uint32_t FLTEN1:1;
  uint32_t F2BP:5;
  uint32_t :2;
  uint32_t FLTEN2:1;
  uint32_t F3BP:5;
  uint32_t :2;
  uint32_t FLTEN3:1;
} __CFD1FLTCON0bits_t;
extern volatile __CFD1FLTCON0bits_t CFD1FLTCON0bits __asm__ ("CFD1FLTCON0") __attribute__((section("sfrs"), address(0xBF880740)));
extern volatile uint32_t        CFD1FLTCON0CLR __attribute__((section("sfrs"),address(0xBF880744)));
extern volatile uint32_t        CFD1FLTCON0SET __attribute__((section("sfrs"),address(0xBF880748)));
extern volatile uint32_t        CFD1FLTCON0INV __attribute__((section("sfrs"),address(0xBF88074C)));
#define CFD1FLTCON1 CFD1FLTCON1
extern volatile uint32_t   CFD1FLTCON1 __attribute__((section("sfrs"), address(0xBF880750)));
typedef struct {
  uint32_t F4BP:5;
  uint32_t :2;
  uint32_t FLTEN4:1;
  uint32_t F5BP:5;
  uint32_t :2;
  uint32_t FLTEN5:1;
  uint32_t F6BP:5;
  uint32_t :2;
  uint32_t FLTEN6:1;
  uint32_t F7BP:5;
  uint32_t :2;
  uint32_t FLTEN7:1;
} __CFD1FLTCON1bits_t;
extern volatile __CFD1FLTCON1bits_t CFD1FLTCON1bits __asm__ ("CFD1FLTCON1") __attribute__((section("sfrs"), address(0xBF880750)));
extern volatile uint32_t        CFD1FLTCON1CLR __attribute__((section("sfrs"),address(0xBF880754)));
extern volatile uint32_t        CFD1FLTCON1SET __attribute__((section("sfrs"),address(0xBF880758)));
extern volatile uint32_t        CFD1FLTCON1INV __attribute__((section("sfrs"),address(0xBF88075C)));
#define CFD1FLTCON2 CFD1FLTCON2
extern volatile uint32_t   CFD1FLTCON2 __attribute__((section("sfrs"), address(0xBF880760)));
typedef struct {
  uint32_t F8BP:5;
  uint32_t :2;
  uint32_t FLTEN8:1;
  uint32_t F9BP:5;
  uint32_t :2;
  uint32_t FLTEN9:1;
  uint32_t F10BP:5;
  uint32_t :2;
  uint32_t FLTEN10:1;
  uint32_t F11BP:5;
  uint32_t :2;
  uint32_t FLTEN11:1;
} __CFD1FLTCON2bits_t;
extern volatile __CFD1FLTCON2bits_t CFD1FLTCON2bits __asm__ ("CFD1FLTCON2") __attribute__((section("sfrs"), address(0xBF880760)));
extern volatile uint32_t        CFD1FLTCON2CLR __attribute__((section("sfrs"),address(0xBF880764)));
extern volatile uint32_t        CFD1FLTCON2SET __attribute__((section("sfrs"),address(0xBF880768)));
extern volatile uint32_t        CFD1FLTCON2INV __attribute__((section("sfrs"),address(0xBF88076C)));
#define CFD1FLTCON3 CFD1FLTCON3
extern volatile uint32_t   CFD1FLTCON3 __attribute__((section("sfrs"), address(0xBF880770)));
typedef struct {
  uint32_t F12BP:5;
  uint32_t :2;
  uint32_t FLTEN12:1;
  uint32_t F13BP:5;
  uint32_t :2;
  uint32_t FLTEN13:1;
  uint32_t F14BP:5;
  uint32_t :2;
  uint32_t FLTEN14:1;
  uint32_t F15BP:5;
  uint32_t :2;
  uint32_t FLTEN15:1;
} __CFD1FLTCON3bits_t;
extern volatile __CFD1FLTCON3bits_t CFD1FLTCON3bits __asm__ ("CFD1FLTCON3") __attribute__((section("sfrs"), address(0xBF880770)));
extern volatile uint32_t        CFD1FLTCON3CLR __attribute__((section("sfrs"),address(0xBF880774)));
extern volatile uint32_t        CFD1FLTCON3SET __attribute__((section("sfrs"),address(0xBF880778)));
extern volatile uint32_t        CFD1FLTCON3INV __attribute__((section("sfrs"),address(0xBF88077C)));
#define CFD1FLTCON4 CFD1FLTCON4
extern volatile uint32_t   CFD1FLTCON4 __attribute__((section("sfrs"), address(0xBF880780)));
typedef struct {
  uint32_t F16BP:5;
  uint32_t :2;
  uint32_t FLTEN16:1;
  uint32_t F17BP:5;
  uint32_t :2;
  uint32_t FLTEN17:1;
  uint32_t F18BP:5;
  uint32_t :2;
  uint32_t FLTEN18:1;
  uint32_t F19BP:5;
  uint32_t :2;
  uint32_t FLTEN19:1;
} __CFD1FLTCON4bits_t;
extern volatile __CFD1FLTCON4bits_t CFD1FLTCON4bits __asm__ ("CFD1FLTCON4") __attribute__((section("sfrs"), address(0xBF880780)));
extern volatile uint32_t        CFD1FLTCON4CLR __attribute__((section("sfrs"),address(0xBF880784)));
extern volatile uint32_t        CFD1FLTCON4SET __attribute__((section("sfrs"),address(0xBF880788)));
extern volatile uint32_t        CFD1FLTCON4INV __attribute__((section("sfrs"),address(0xBF88078C)));
#define CFD1FLTCON5 CFD1FLTCON5
extern volatile uint32_t   CFD1FLTCON5 __attribute__((section("sfrs"), address(0xBF880790)));
typedef struct {
  uint32_t F20BP:5;
  uint32_t :2;
  uint32_t FLTEN20:1;
  uint32_t F21BP:5;
  uint32_t :2;
  uint32_t FLTEN21:1;
  uint32_t F22BP:5;
  uint32_t :2;
  uint32_t FLTEN22:1;
  uint32_t F23BP:5;
  uint32_t :2;
  uint32_t FLTEN23:1;
} __CFD1FLTCON5bits_t;
extern volatile __CFD1FLTCON5bits_t CFD1FLTCON5bits __asm__ ("CFD1FLTCON5") __attribute__((section("sfrs"), address(0xBF880790)));
extern volatile uint32_t        CFD1FLTCON5CLR __attribute__((section("sfrs"),address(0xBF880794)));
extern volatile uint32_t        CFD1FLTCON5SET __attribute__((section("sfrs"),address(0xBF880798)));
extern volatile uint32_t        CFD1FLTCON5INV __attribute__((section("sfrs"),address(0xBF88079C)));
#define CFD1FLTCON6 CFD1FLTCON6
extern volatile uint32_t   CFD1FLTCON6 __attribute__((section("sfrs"), address(0xBF8807A0)));
typedef struct {
  uint32_t F24BP:5;
  uint32_t :2;
  uint32_t FLTEN24:1;
  uint32_t F25BP:5;
  uint32_t :2;
  uint32_t FLTEN25:1;
  uint32_t F26BP:5;
  uint32_t :2;
  uint32_t FLTEN26:1;
  uint32_t F27BP:5;
  uint32_t :2;
  uint32_t FLTEN27:1;
} __CFD1FLTCON6bits_t;
extern volatile __CFD1FLTCON6bits_t CFD1FLTCON6bits __asm__ ("CFD1FLTCON6") __attribute__((section("sfrs"), address(0xBF8807A0)));
extern volatile uint32_t        CFD1FLTCON6CLR __attribute__((section("sfrs"),address(0xBF8807A4)));
extern volatile uint32_t        CFD1FLTCON6SET __attribute__((section("sfrs"),address(0xBF8807A8)));
extern volatile uint32_t        CFD1FLTCON6INV __attribute__((section("sfrs"),address(0xBF8807AC)));
#define CFD1FLTCON7 CFD1FLTCON7
extern volatile uint32_t   CFD1FLTCON7 __attribute__((section("sfrs"), address(0xBF8807B0)));
typedef struct {
  uint32_t F28BP:5;
  uint32_t :2;
  uint32_t FLTEN28:1;
  uint32_t F29BP:5;
  uint32_t :2;
  uint32_t FLTEN29:1;
  uint32_t F30BP:5;
  uint32_t :2;
  uint32_t FLTEN30:1;
  uint32_t F31BP:5;
  uint32_t :2;
  uint32_t FLTEN31:1;
} __CFD1FLTCON7bits_t;
