Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0512gph048.h
extern volatile __ADC0CFGbits_t ADC0CFGbits __asm__ ("ADC0CFG") __attribute__((section("sfrs"), address(0xBF887D00)));
extern volatile uint32_t        ADC0CFGCLR __attribute__((section("sfrs"),address(0xBF887D04)));
extern volatile uint32_t        ADC0CFGSET __attribute__((section("sfrs"),address(0xBF887D08)));
extern volatile uint32_t        ADC0CFGINV __attribute__((section("sfrs"),address(0xBF887D0C)));
#define ADC1CFG ADC1CFG
extern volatile uint32_t   ADC1CFG __attribute__((section("sfrs"), address(0xBF887D10)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC1CFGbits_t;
extern volatile __ADC1CFGbits_t ADC1CFGbits __asm__ ("ADC1CFG") __attribute__((section("sfrs"), address(0xBF887D10)));
extern volatile uint32_t        ADC1CFGCLR __attribute__((section("sfrs"),address(0xBF887D14)));
extern volatile uint32_t        ADC1CFGSET __attribute__((section("sfrs"),address(0xBF887D18)));
extern volatile uint32_t        ADC1CFGINV __attribute__((section("sfrs"),address(0xBF887D1C)));
#define ADC2CFG ADC2CFG
extern volatile uint32_t   ADC2CFG __attribute__((section("sfrs"), address(0xBF887D20)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC2CFGbits_t;
extern volatile __ADC2CFGbits_t ADC2CFGbits __asm__ ("ADC2CFG") __attribute__((section("sfrs"), address(0xBF887D20)));
extern volatile uint32_t        ADC2CFGCLR __attribute__((section("sfrs"),address(0xBF887D24)));
extern volatile uint32_t        ADC2CFGSET __attribute__((section("sfrs"),address(0xBF887D28)));
extern volatile uint32_t        ADC2CFGINV __attribute__((section("sfrs"),address(0xBF887D2C)));
#define ADC3CFG ADC3CFG
extern volatile uint32_t   ADC3CFG __attribute__((section("sfrs"), address(0xBF887D30)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC3CFGbits_t;
extern volatile __ADC3CFGbits_t ADC3CFGbits __asm__ ("ADC3CFG") __attribute__((section("sfrs"), address(0xBF887D30)));
extern volatile uint32_t        ADC3CFGCLR __attribute__((section("sfrs"),address(0xBF887D34)));
extern volatile uint32_t        ADC3CFGSET __attribute__((section("sfrs"),address(0xBF887D38)));
extern volatile uint32_t        ADC3CFGINV __attribute__((section("sfrs"),address(0xBF887D3C)));
#define ADC4CFG ADC4CFG
extern volatile uint32_t   ADC4CFG __attribute__((section("sfrs"), address(0xBF887D40)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC4CFGbits_t;
extern volatile __ADC4CFGbits_t ADC4CFGbits __asm__ ("ADC4CFG") __attribute__((section("sfrs"), address(0xBF887D40)));
extern volatile uint32_t        ADC4CFGCLR __attribute__((section("sfrs"),address(0xBF887D44)));
extern volatile uint32_t        ADC4CFGSET __attribute__((section("sfrs"),address(0xBF887D48)));
extern volatile uint32_t        ADC4CFGINV __attribute__((section("sfrs"),address(0xBF887D4C)));
#define ADC5CFG ADC5CFG
extern volatile uint32_t   ADC5CFG __attribute__((section("sfrs"), address(0xBF887D50)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC5CFGbits_t;
extern volatile __ADC5CFGbits_t ADC5CFGbits __asm__ ("ADC5CFG") __attribute__((section("sfrs"), address(0xBF887D50)));
extern volatile uint32_t        ADC5CFGCLR __attribute__((section("sfrs"),address(0xBF887D54)));
extern volatile uint32_t        ADC5CFGSET __attribute__((section("sfrs"),address(0xBF887D58)));
extern volatile uint32_t        ADC5CFGINV __attribute__((section("sfrs"),address(0xBF887D5C)));
#define ADC6CFG ADC6CFG
extern volatile uint32_t   ADC6CFG __attribute__((section("sfrs"), address(0xBF887D60)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC6CFGbits_t;
extern volatile __ADC6CFGbits_t ADC6CFGbits __asm__ ("ADC6CFG") __attribute__((section("sfrs"), address(0xBF887D60)));
extern volatile uint32_t        ADC6CFGCLR __attribute__((section("sfrs"),address(0xBF887D64)));
extern volatile uint32_t        ADC6CFGSET __attribute__((section("sfrs"),address(0xBF887D68)));
extern volatile uint32_t        ADC6CFGINV __attribute__((section("sfrs"),address(0xBF887D6C)));
#define ADC7CFG ADC7CFG
extern volatile uint32_t   ADC7CFG __attribute__((section("sfrs"), address(0xBF887D70)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC7CFGbits_t;
extern volatile __ADC7CFGbits_t ADC7CFGbits __asm__ ("ADC7CFG") __attribute__((section("sfrs"), address(0xBF887D70)));
extern volatile uint32_t        ADC7CFGCLR __attribute__((section("sfrs"),address(0xBF887D74)));
extern volatile uint32_t        ADC7CFGSET __attribute__((section("sfrs"),address(0xBF887D78)));
extern volatile uint32_t        ADC7CFGINV __attribute__((section("sfrs"),address(0xBF887D7C)));
#define ADCSYSCFG0 ADCSYSCFG0
extern volatile uint32_t   ADCSYSCFG0 __attribute__((section("sfrs"), address(0xBF887E00)));
typedef struct {
  uint32_t AN0:1;
  uint32_t AN1:1;
  uint32_t AN2:1;
  uint32_t AN3:1;
  uint32_t AN4:1;
  uint32_t AN5:1;
  uint32_t AN6:1;
  uint32_t AN7:1;
  uint32_t AN8:1;
  uint32_t AN9:1;
  uint32_t AN10:1;
  uint32_t AN11:1;
  uint32_t AN12:1;
  uint32_t AN13:1;
  uint32_t AN14:1;
  uint32_t AN15:1;
  uint32_t AN16:1;
  uint32_t AN17:1;
  uint32_t AN18:1;
  uint32_t AN19:1;
  uint32_t AN20:1;
  uint32_t AN21:1;
  uint32_t AN22:1;
  uint32_t AN23:1;
  uint32_t AN24:1;
  uint32_t AN25:1;
  uint32_t AN26:1;
  uint32_t AN27:1;
} __ADCSYSCFG0bits_t;
extern volatile __ADCSYSCFG0bits_t ADCSYSCFG0bits __asm__ ("ADCSYSCFG0") __attribute__((section("sfrs"), address(0xBF887E00)));
extern volatile uint32_t        ADCSYSCFG0CLR __attribute__((section("sfrs"),address(0xBF887E04)));
extern volatile uint32_t        ADCSYSCFG0SET __attribute__((section("sfrs"),address(0xBF887E08)));
extern volatile uint32_t        ADCSYSCFG0INV __attribute__((section("sfrs"),address(0xBF887E0C)));
#define ADCSYSCFG1 ADCSYSCFG1
extern volatile uint32_t   ADCSYSCFG1 __attribute__((section("sfrs"), address(0xBF887E10)));
typedef struct {
  uint32_t :1;
  uint32_t AN33:1;
  uint32_t AN34:1;
  uint32_t AN35:1;
  uint32_t AN36:1;
  uint32_t AN37:1;
  uint32_t AN38:1;
  uint32_t AN39:1;
  uint32_t AN40:1;
  uint32_t AN41:1;
  uint32_t :3;
  uint32_t AN45:1;
  uint32_t AN46:1;
  uint32_t AN47:1;
  uint32_t AN48:1;
  uint32_t AN49:1;
  uint32_t AN50:1;
  uint32_t AN51:1;
  uint32_t AN52:1;
  uint32_t AN53:1;
} __ADCSYSCFG1bits_t;
extern volatile __ADCSYSCFG1bits_t ADCSYSCFG1bits __asm__ ("ADCSYSCFG1") __attribute__((section("sfrs"), address(0xBF887E10)));
extern volatile uint32_t        ADCSYSCFG1CLR __attribute__((section("sfrs"),address(0xBF887E14)));
extern volatile uint32_t        ADCSYSCFG1SET __attribute__((section("sfrs"),address(0xBF887E18)));
extern volatile uint32_t        ADCSYSCFG1INV __attribute__((section("sfrs"),address(0xBF887E1C)));
#define RTCCON RTCCON
extern volatile uint32_t   RTCCON __attribute__((section("sfrs"), address(0xBF8C0000)));
typedef union {
  struct {
    uint32_t RTCOE:1;
    uint32_t HALFSEC:1;
    uint32_t RTCSYNC:1;
    uint32_t RTCWREN:1;
    uint32_t :2;
    uint32_t RTCCLKON:1;
    uint32_t RTCOUTSEL:2;
    uint32_t RTCCLKSEL:2;
    uint32_t :2;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t CAL:10;
  };
  struct {
    uint32_t w:32;
  };
} __RTCCONbits_t;
extern volatile __RTCCONbits_t RTCCONbits __asm__ ("RTCCON") __attribute__((section("sfrs"), address(0xBF8C0000)));
extern volatile uint32_t        RTCCONCLR __attribute__((section("sfrs"),address(0xBF8C0004)));
extern volatile uint32_t        RTCCONSET __attribute__((section("sfrs"),address(0xBF8C0008)));
extern volatile uint32_t        RTCCONINV __attribute__((section("sfrs"),address(0xBF8C000C)));
#define RTCALRM RTCALRM
extern volatile uint32_t   RTCALRM __attribute__((section("sfrs"), address(0xBF8C0010)));
typedef union {
  struct {
    uint32_t ARPT:8;
    uint32_t AMASK:4;
    uint32_t ALRMSYNC:1;
    uint32_t PIV:1;
    uint32_t CHIME:1;
    uint32_t ALRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __RTCALRMbits_t;
extern volatile __RTCALRMbits_t RTCALRMbits __asm__ ("RTCALRM") __attribute__((section("sfrs"), address(0xBF8C0010)));
extern volatile uint32_t        RTCALRMCLR __attribute__((section("sfrs"),address(0xBF8C0014)));
extern volatile uint32_t        RTCALRMSET __attribute__((section("sfrs"),address(0xBF8C0018)));
extern volatile uint32_t        RTCALRMINV __attribute__((section("sfrs"),address(0xBF8C001C)));
#define RTCTIME RTCTIME
extern volatile uint32_t   RTCTIME __attribute__((section("sfrs"), address(0xBF8C0020)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SEC01:4;
    uint32_t SEC10:4;
    uint32_t MIN01:4;
    uint32_t MIN10:4;
    uint32_t HR01:4;
    uint32_t HR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __RTCTIMEbits_t;
