Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0512gph048.h
extern volatile __ABF1DEVCFG3bits_t ABF1DEVCFG3bits __asm__ ("ABF1DEVCFG3") __attribute__((section("sfrs"), address(0xBFC43F40)));
#define ABF1DEVCFG2 ABF1DEVCFG2
extern volatile uint32_t   ABF1DEVCFG2 __attribute__((section("sfrs"), address(0xBFC43F44)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t :1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t BORSEL:1;
    uint32_t :1;
    uint32_t UPLLEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCFG2bits_t;
extern volatile __ABF1DEVCFG2bits_t ABF1DEVCFG2bits __asm__ ("ABF1DEVCFG2") __attribute__((section("sfrs"), address(0xBFC43F44)));
#define ABF1DEVCFG1 ABF1DEVCFG1
extern volatile uint32_t   ABF1DEVCFG1 __attribute__((section("sfrs"), address(0xBFC43F48)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCFG1bits_t;
extern volatile __ABF1DEVCFG1bits_t ABF1DEVCFG1bits __asm__ ("ABF1DEVCFG1") __attribute__((section("sfrs"), address(0xBFC43F48)));
#define ABF1DEVCFG0 ABF1DEVCFG0
extern volatile uint32_t   ABF1DEVCFG0 __attribute__((section("sfrs"), address(0xBFC43F4C)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCAGCDLY:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCFG0bits_t;
extern volatile __ABF1DEVCFG0bits_t ABF1DEVCFG0bits __asm__ ("ABF1DEVCFG0") __attribute__((section("sfrs"), address(0xBFC43F4C)));
#define ABF1DEVCP ABF1DEVCP
extern volatile uint32_t   ABF1DEVCP __attribute__((section("sfrs"), address(0xBFC43F5C)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCPbits_t;
extern volatile __ABF1DEVCPbits_t ABF1DEVCPbits __asm__ ("ABF1DEVCP") __attribute__((section("sfrs"), address(0xBFC43F5C)));
#define ABF1DEVSIGN ABF1DEVSIGN
extern volatile uint32_t   ABF1DEVSIGN __attribute__((section("sfrs"), address(0xBFC43F6C)));
#define ABF1SEQ ABF1SEQ
extern volatile uint32_t   ABF1SEQ __attribute__((section("sfrs"), address(0xBFC43F70)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1SEQbits_t;
extern volatile __ABF1SEQbits_t ABF1SEQbits __asm__ ("ABF1SEQ") __attribute__((section("sfrs"), address(0xBFC43F70)));
#define BF1DEVCFG3 BF1DEVCFG3
extern volatile uint32_t   BF1DEVCFG3 __attribute__((section("sfrs"), address(0xBFC43FC0)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :4;
    uint32_t PWMLOCK:1;
    uint32_t :6;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
    uint32_t FUSBIDIO1:1;
    uint32_t FVBUSIO1:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCFG3bits_t;
extern volatile __BF1DEVCFG3bits_t BF1DEVCFG3bits __asm__ ("BF1DEVCFG3") __attribute__((section("sfrs"), address(0xBFC43FC0)));
#define BF1DEVCFG2 BF1DEVCFG2
extern volatile uint32_t   BF1DEVCFG2 __attribute__((section("sfrs"), address(0xBFC43FC4)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t :1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t BORSEL:1;
    uint32_t :1;
    uint32_t UPLLEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCFG2bits_t;
extern volatile __BF1DEVCFG2bits_t BF1DEVCFG2bits __asm__ ("BF1DEVCFG2") __attribute__((section("sfrs"), address(0xBFC43FC4)));
#define BF1DEVCFG1 BF1DEVCFG1
extern volatile uint32_t   BF1DEVCFG1 __attribute__((section("sfrs"), address(0xBFC43FC8)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCFG1bits_t;
extern volatile __BF1DEVCFG1bits_t BF1DEVCFG1bits __asm__ ("BF1DEVCFG1") __attribute__((section("sfrs"), address(0xBFC43FC8)));
#define BF1DEVCFG0 BF1DEVCFG0
extern volatile uint32_t   BF1DEVCFG0 __attribute__((section("sfrs"), address(0xBFC43FCC)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCAGCDLY:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCFG0bits_t;
extern volatile __BF1DEVCFG0bits_t BF1DEVCFG0bits __asm__ ("BF1DEVCFG0") __attribute__((section("sfrs"), address(0xBFC43FCC)));
#define BF1DEVCP BF1DEVCP
extern volatile uint32_t   BF1DEVCP __attribute__((section("sfrs"), address(0xBFC43FDC)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCPbits_t;
extern volatile __BF1DEVCPbits_t BF1DEVCPbits __asm__ ("BF1DEVCP") __attribute__((section("sfrs"), address(0xBFC43FDC)));
#define BF1DEVSIGN BF1DEVSIGN
extern volatile uint32_t   BF1DEVSIGN __attribute__((section("sfrs"), address(0xBFC43FEC)));
#define BF1SEQ BF1SEQ
extern volatile uint32_t   BF1SEQ __attribute__((section("sfrs"), address(0xBFC43FF0)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __BF1SEQbits_t;
extern volatile __BF1SEQbits_t BF1SEQbits __asm__ ("BF1SEQ") __attribute__((section("sfrs"), address(0xBFC43FF0)));
#ifdef __cplusplus
}
#endif

