Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0512gph048.h
#define _IPC38_AD1D48IS_POSITION                 0x00000010
#define _IPC38_AD1D48IS_MASK                     0x00030000
#define _IPC38_AD1D48IS_LENGTH                   0x00000002

#define _IPC38_AD1D48IP_POSITION                 0x00000012
#define _IPC38_AD1D48IP_MASK                     0x001C0000
#define _IPC38_AD1D48IP_LENGTH                   0x00000003

#define _IPC38_AD1D49IS_POSITION                 0x00000018
#define _IPC38_AD1D49IS_MASK                     0x03000000
#define _IPC38_AD1D49IS_LENGTH                   0x00000002

#define _IPC38_AD1D49IP_POSITION                 0x0000001A
#define _IPC38_AD1D49IP_MASK                     0x1C000000
#define _IPC38_AD1D49IP_LENGTH                   0x00000003

#define _IPC38_w_POSITION                        0x00000000
#define _IPC38_w_MASK                            0xFFFFFFFF
#define _IPC38_w_LENGTH                          0x00000020

#define _IPC39_AD1D50IS_POSITION                 0x00000000
#define _IPC39_AD1D50IS_MASK                     0x00000003
#define _IPC39_AD1D50IS_LENGTH                   0x00000002

#define _IPC39_AD1D50IP_POSITION                 0x00000002
#define _IPC39_AD1D50IP_MASK                     0x0000001C
#define _IPC39_AD1D50IP_LENGTH                   0x00000003

#define _IPC39_AD1D51IS_POSITION                 0x00000008
#define _IPC39_AD1D51IS_MASK                     0x00000300
#define _IPC39_AD1D51IS_LENGTH                   0x00000002

#define _IPC39_AD1D51IP_POSITION                 0x0000000A
#define _IPC39_AD1D51IP_MASK                     0x00001C00
#define _IPC39_AD1D51IP_LENGTH                   0x00000003

#define _IPC39_AD1D52IS_POSITION                 0x00000010
#define _IPC39_AD1D52IS_MASK                     0x00030000
#define _IPC39_AD1D52IS_LENGTH                   0x00000002

#define _IPC39_AD1D52IP_POSITION                 0x00000012
#define _IPC39_AD1D52IP_MASK                     0x001C0000
#define _IPC39_AD1D52IP_LENGTH                   0x00000003

#define _IPC39_AD1D53IS_POSITION                 0x00000018
#define _IPC39_AD1D53IS_MASK                     0x03000000
#define _IPC39_AD1D53IS_LENGTH                   0x00000002

#define _IPC39_AD1D53IP_POSITION                 0x0000001A
#define _IPC39_AD1D53IP_MASK                     0x1C000000
#define _IPC39_AD1D53IP_LENGTH                   0x00000003

#define _IPC39_w_POSITION                        0x00000000
#define _IPC39_w_MASK                            0xFFFFFFFF
#define _IPC39_w_LENGTH                          0x00000020

#define _IPC40_CMP3IS_POSITION                   0x00000000
#define _IPC40_CMP3IS_MASK                       0x00000003
#define _IPC40_CMP3IS_LENGTH                     0x00000002

#define _IPC40_CMP3IP_POSITION                   0x00000002
#define _IPC40_CMP3IP_MASK                       0x0000001C
#define _IPC40_CMP3IP_LENGTH                     0x00000003

#define _IPC40_CMP4IS_POSITION                   0x00000008
#define _IPC40_CMP4IS_MASK                       0x00000300
#define _IPC40_CMP4IS_LENGTH                     0x00000002

#define _IPC40_CMP4IP_POSITION                   0x0000000A
#define _IPC40_CMP4IP_MASK                       0x00001C00
#define _IPC40_CMP4IP_LENGTH                     0x00000003

#define _IPC40_CMP5IS_POSITION                   0x00000010
#define _IPC40_CMP5IS_MASK                       0x00030000
#define _IPC40_CMP5IS_LENGTH                     0x00000002

#define _IPC40_CMP5IP_POSITION                   0x00000012
#define _IPC40_CMP5IP_MASK                       0x001C0000
#define _IPC40_CMP5IP_LENGTH                     0x00000003

#define _IPC40_w_POSITION                        0x00000000
#define _IPC40_w_MASK                            0xFFFFFFFF
#define _IPC40_w_LENGTH                          0x00000020

#define _IPC41_CAN1IS_POSITION                   0x00000018
#define _IPC41_CAN1IS_MASK                       0x03000000
#define _IPC41_CAN1IS_LENGTH                     0x00000002

#define _IPC41_CAN1IP_POSITION                   0x0000001A
#define _IPC41_CAN1IP_MASK                       0x1C000000
#define _IPC41_CAN1IP_LENGTH                     0x00000003

#define _IPC41_w_POSITION                        0x00000000
#define _IPC41_w_MASK                            0xFFFFFFFF
#define _IPC41_w_LENGTH                          0x00000020

#define _IPC45_DMA4IS_POSITION                   0x00000010
#define _IPC45_DMA4IS_MASK                       0x00030000
#define _IPC45_DMA4IS_LENGTH                     0x00000002

#define _IPC45_DMA4IP_POSITION                   0x00000012
#define _IPC45_DMA4IP_MASK                       0x001C0000
#define _IPC45_DMA4IP_LENGTH                     0x00000003

#define _IPC45_DMA5IS_POSITION                   0x00000018
#define _IPC45_DMA5IS_MASK                       0x03000000
#define _IPC45_DMA5IS_LENGTH                     0x00000002

#define _IPC45_DMA5IP_POSITION                   0x0000001A
#define _IPC45_DMA5IP_MASK                       0x1C000000
#define _IPC45_DMA5IP_LENGTH                     0x00000003

#define _IPC45_w_POSITION                        0x00000000
#define _IPC45_w_MASK                            0xFFFFFFFF
#define _IPC45_w_LENGTH                          0x00000020

#define _IPC46_DMA6IS_POSITION                   0x00000000
#define _IPC46_DMA6IS_MASK                       0x00000003
#define _IPC46_DMA6IS_LENGTH                     0x00000002

#define _IPC46_DMA6IP_POSITION                   0x00000002
#define _IPC46_DMA6IP_MASK                       0x0000001C
#define _IPC46_DMA6IP_LENGTH                     0x00000003

#define _IPC46_DMA7IS_POSITION                   0x00000008
#define _IPC46_DMA7IS_MASK                       0x00000300
#define _IPC46_DMA7IS_LENGTH                     0x00000002

#define _IPC46_DMA7IP_POSITION                   0x0000000A
#define _IPC46_DMA7IP_MASK                       0x00001C00
#define _IPC46_DMA7IP_LENGTH                     0x00000003

#define _IPC46_w_POSITION                        0x00000000
#define _IPC46_w_MASK                            0xFFFFFFFF
#define _IPC46_w_LENGTH                          0x00000020

#define _IPC57_SBIS_POSITION                     0x00000010
#define _IPC57_SBIS_MASK                         0x00030000
#define _IPC57_SBIS_LENGTH                       0x00000002

#define _IPC57_SBIP_POSITION                     0x00000012
#define _IPC57_SBIP_MASK                         0x001C0000
#define _IPC57_SBIP_LENGTH                       0x00000003

#define _IPC57_w_POSITION                        0x00000000
#define _IPC57_w_MASK                            0xFFFFFFFF
#define _IPC57_w_LENGTH                          0x00000020

