Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0512gph048.h
#define _ADCTRGSNS_LVL16_POSITION                0x00000010
#define _ADCTRGSNS_LVL16_MASK                    0x00010000
#define _ADCTRGSNS_LVL16_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL17_POSITION                0x00000011
#define _ADCTRGSNS_LVL17_MASK                    0x00020000
#define _ADCTRGSNS_LVL17_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL18_POSITION                0x00000012
#define _ADCTRGSNS_LVL18_MASK                    0x00040000
#define _ADCTRGSNS_LVL18_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL19_POSITION                0x00000013
#define _ADCTRGSNS_LVL19_MASK                    0x00080000
#define _ADCTRGSNS_LVL19_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL20_POSITION                0x00000014
#define _ADCTRGSNS_LVL20_MASK                    0x00100000
#define _ADCTRGSNS_LVL20_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL21_POSITION                0x00000015
#define _ADCTRGSNS_LVL21_MASK                    0x00200000
#define _ADCTRGSNS_LVL21_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL22_POSITION                0x00000016
#define _ADCTRGSNS_LVL22_MASK                    0x00400000
#define _ADCTRGSNS_LVL22_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL23_POSITION                0x00000017
#define _ADCTRGSNS_LVL23_MASK                    0x00800000
#define _ADCTRGSNS_LVL23_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL24_POSITION                0x00000018
#define _ADCTRGSNS_LVL24_MASK                    0x01000000
#define _ADCTRGSNS_LVL24_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL25_POSITION                0x00000019
#define _ADCTRGSNS_LVL25_MASK                    0x02000000
#define _ADCTRGSNS_LVL25_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL26_POSITION                0x0000001A
#define _ADCTRGSNS_LVL26_MASK                    0x04000000
#define _ADCTRGSNS_LVL26_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL27_POSITION                0x0000001B
#define _ADCTRGSNS_LVL27_MASK                    0x08000000
#define _ADCTRGSNS_LVL27_LENGTH                  0x00000001

#define _ADC0TIME_SAMC_POSITION                  0x00000000
#define _ADC0TIME_SAMC_MASK                      0x000003FF
#define _ADC0TIME_SAMC_LENGTH                    0x0000000A

#define _ADC0TIME_ADCDIV_POSITION                0x00000010
#define _ADC0TIME_ADCDIV_MASK                    0x007F0000
#define _ADC0TIME_ADCDIV_LENGTH                  0x00000007

#define _ADC0TIME_BCHEN_POSITION                 0x00000017
#define _ADC0TIME_BCHEN_MASK                     0x00800000
#define _ADC0TIME_BCHEN_LENGTH                   0x00000001

#define _ADC0TIME_SELRES_POSITION                0x00000018
#define _ADC0TIME_SELRES_MASK                    0x03000000
#define _ADC0TIME_SELRES_LENGTH                  0x00000002

#define _ADC0TIME_ADCEIS_POSITION                0x0000001A
#define _ADC0TIME_ADCEIS_MASK                    0x1C000000
#define _ADC0TIME_ADCEIS_LENGTH                  0x00000003

#define _ADC1TIME_SAMC_POSITION                  0x00000000
#define _ADC1TIME_SAMC_MASK                      0x000003FF
#define _ADC1TIME_SAMC_LENGTH                    0x0000000A

#define _ADC1TIME_ADCDIV_POSITION                0x00000010
#define _ADC1TIME_ADCDIV_MASK                    0x007F0000
#define _ADC1TIME_ADCDIV_LENGTH                  0x00000007

#define _ADC1TIME_BCHEN_POSITION                 0x00000017
#define _ADC1TIME_BCHEN_MASK                     0x00800000
#define _ADC1TIME_BCHEN_LENGTH                   0x00000001

#define _ADC1TIME_SELRES_POSITION                0x00000018
#define _ADC1TIME_SELRES_MASK                    0x03000000
#define _ADC1TIME_SELRES_LENGTH                  0x00000002

#define _ADC1TIME_ADCEIS_POSITION                0x0000001A
#define _ADC1TIME_ADCEIS_MASK                    0x1C000000
#define _ADC1TIME_ADCEIS_LENGTH                  0x00000003

#define _ADC2TIME_SAMC_POSITION                  0x00000000
#define _ADC2TIME_SAMC_MASK                      0x000003FF
#define _ADC2TIME_SAMC_LENGTH                    0x0000000A

#define _ADC2TIME_ADCDIV_POSITION                0x00000010
#define _ADC2TIME_ADCDIV_MASK                    0x007F0000
#define _ADC2TIME_ADCDIV_LENGTH                  0x00000007

#define _ADC2TIME_BCHEN_POSITION                 0x00000017
#define _ADC2TIME_BCHEN_MASK                     0x00800000
#define _ADC2TIME_BCHEN_LENGTH                   0x00000001

#define _ADC2TIME_SELRES_POSITION                0x00000018
#define _ADC2TIME_SELRES_MASK                    0x03000000
#define _ADC2TIME_SELRES_LENGTH                  0x00000002

#define _ADC2TIME_ADCEIS_POSITION                0x0000001A
#define _ADC2TIME_ADCEIS_MASK                    0x1C000000
#define _ADC2TIME_ADCEIS_LENGTH                  0x00000003

#define _ADC3TIME_SAMC_POSITION                  0x00000000
#define _ADC3TIME_SAMC_MASK                      0x000003FF
#define _ADC3TIME_SAMC_LENGTH                    0x0000000A

#define _ADC3TIME_ADCDIV_POSITION                0x00000010
#define _ADC3TIME_ADCDIV_MASK                    0x007F0000
#define _ADC3TIME_ADCDIV_LENGTH                  0x00000007

#define _ADC3TIME_BCHEN_POSITION                 0x00000017
#define _ADC3TIME_BCHEN_MASK                     0x00800000
#define _ADC3TIME_BCHEN_LENGTH                   0x00000001

#define _ADC3TIME_SELRES_POSITION                0x00000018
#define _ADC3TIME_SELRES_MASK                    0x03000000
#define _ADC3TIME_SELRES_LENGTH                  0x00000002

#define _ADC3TIME_ADCEIS_POSITION                0x0000001A
#define _ADC3TIME_ADCEIS_MASK                    0x1C000000
#define _ADC3TIME_ADCEIS_LENGTH                  0x00000003

#define _ADC4TIME_SAMC_POSITION                  0x00000000
#define _ADC4TIME_SAMC_MASK                      0x000003FF
#define _ADC4TIME_SAMC_LENGTH                    0x0000000A

#define _ADC4TIME_ADCDIV_POSITION                0x00000010
#define _ADC4TIME_ADCDIV_MASK                    0x007F0000
#define _ADC4TIME_ADCDIV_LENGTH                  0x00000007

