Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0512gph048.h
#define _ADCEISTAT1_EIRDY14_POSITION             0x0000000E
#define _ADCEISTAT1_EIRDY14_MASK                 0x00004000
#define _ADCEISTAT1_EIRDY14_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY15_POSITION             0x0000000F
#define _ADCEISTAT1_EIRDY15_MASK                 0x00008000
#define _ADCEISTAT1_EIRDY15_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY16_POSITION             0x00000010
#define _ADCEISTAT1_EIRDY16_MASK                 0x00010000
#define _ADCEISTAT1_EIRDY16_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY17_POSITION             0x00000011
#define _ADCEISTAT1_EIRDY17_MASK                 0x00020000
#define _ADCEISTAT1_EIRDY17_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY18_POSITION             0x00000012
#define _ADCEISTAT1_EIRDY18_MASK                 0x00040000
#define _ADCEISTAT1_EIRDY18_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY19_POSITION             0x00000013
#define _ADCEISTAT1_EIRDY19_MASK                 0x00080000
#define _ADCEISTAT1_EIRDY19_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY20_POSITION             0x00000014
#define _ADCEISTAT1_EIRDY20_MASK                 0x00100000
#define _ADCEISTAT1_EIRDY20_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY21_POSITION             0x00000015
#define _ADCEISTAT1_EIRDY21_MASK                 0x00200000
#define _ADCEISTAT1_EIRDY21_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY22_POSITION             0x00000016
#define _ADCEISTAT1_EIRDY22_MASK                 0x00400000
#define _ADCEISTAT1_EIRDY22_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY23_POSITION             0x00000017
#define _ADCEISTAT1_EIRDY23_MASK                 0x00800000
#define _ADCEISTAT1_EIRDY23_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY24_POSITION             0x00000018
#define _ADCEISTAT1_EIRDY24_MASK                 0x01000000
#define _ADCEISTAT1_EIRDY24_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY25_POSITION             0x00000019
#define _ADCEISTAT1_EIRDY25_MASK                 0x02000000
#define _ADCEISTAT1_EIRDY25_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY26_POSITION             0x0000001A
#define _ADCEISTAT1_EIRDY26_MASK                 0x04000000
#define _ADCEISTAT1_EIRDY26_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY27_POSITION             0x0000001B
#define _ADCEISTAT1_EIRDY27_MASK                 0x08000000
#define _ADCEISTAT1_EIRDY27_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY33_POSITION             0x00000001
#define _ADCEISTAT2_EIRDY33_MASK                 0x00000002
#define _ADCEISTAT2_EIRDY33_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY34_POSITION             0x00000002
#define _ADCEISTAT2_EIRDY34_MASK                 0x00000004
#define _ADCEISTAT2_EIRDY34_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY35_POSITION             0x00000003
#define _ADCEISTAT2_EIRDY35_MASK                 0x00000008
#define _ADCEISTAT2_EIRDY35_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY36_POSITION             0x00000004
#define _ADCEISTAT2_EIRDY36_MASK                 0x00000010
#define _ADCEISTAT2_EIRDY36_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY37_POSITION             0x00000005
#define _ADCEISTAT2_EIRDY37_MASK                 0x00000020
#define _ADCEISTAT2_EIRDY37_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY38_POSITION             0x00000006
#define _ADCEISTAT2_EIRDY38_MASK                 0x00000040
#define _ADCEISTAT2_EIRDY38_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY39_POSITION             0x00000007
#define _ADCEISTAT2_EIRDY39_MASK                 0x00000080
#define _ADCEISTAT2_EIRDY39_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY40_POSITION             0x00000008
#define _ADCEISTAT2_EIRDY40_MASK                 0x00000100
#define _ADCEISTAT2_EIRDY40_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY41_POSITION             0x00000009
#define _ADCEISTAT2_EIRDY41_MASK                 0x00000200
#define _ADCEISTAT2_EIRDY41_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY45_POSITION             0x0000000D
#define _ADCEISTAT2_EIRDY45_MASK                 0x00002000
#define _ADCEISTAT2_EIRDY45_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY46_POSITION             0x0000000E
#define _ADCEISTAT2_EIRDY46_MASK                 0x00004000
#define _ADCEISTAT2_EIRDY46_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY47_POSITION             0x0000000F
#define _ADCEISTAT2_EIRDY47_MASK                 0x00008000
#define _ADCEISTAT2_EIRDY47_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY48_POSITION             0x00000010
#define _ADCEISTAT2_EIRDY48_MASK                 0x00010000
#define _ADCEISTAT2_EIRDY48_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY49_POSITION             0x00000011
#define _ADCEISTAT2_EIRDY49_MASK                 0x00020000
#define _ADCEISTAT2_EIRDY49_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY50_POSITION             0x00000012
#define _ADCEISTAT2_EIRDY50_MASK                 0x00040000
#define _ADCEISTAT2_EIRDY50_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY51_POSITION             0x00000013
#define _ADCEISTAT2_EIRDY51_MASK                 0x00080000
#define _ADCEISTAT2_EIRDY51_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY52_POSITION             0x00000014
#define _ADCEISTAT2_EIRDY52_MASK                 0x00100000
#define _ADCEISTAT2_EIRDY52_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY53_POSITION             0x00000015
#define _ADCEISTAT2_EIRDY53_MASK                 0x00200000
#define _ADCEISTAT2_EIRDY53_LENGTH               0x00000001

#define _ADCANCON_ANEN0_POSITION                 0x00000000
#define _ADCANCON_ANEN0_MASK                     0x00000001
#define _ADCANCON_ANEN0_LENGTH                   0x00000001

#define _ADCANCON_ANEN1_POSITION                 0x00000001
#define _ADCANCON_ANEN1_MASK                     0x00000002
#define _ADCANCON_ANEN1_LENGTH                   0x00000001

#define _ADCANCON_ANEN2_POSITION                 0x00000002
#define _ADCANCON_ANEN2_MASK                     0x00000004
#define _ADCANCON_ANEN2_LENGTH                   0x00000001

